#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.realfire_cloud.cloudflare_record.terraform_managed_resource_1b00ada15f8487843dc8e90f51defc59: Refreshing state... [id=1b00ada15f8487843dc8e90f51defc59]
module.realfire_dev.cloudflare_record.spf: Refreshing state... [id=a04900f1cff0cc9df186393625e9d629]
module.protectedpii_com.cloudflare_record.mx: Refreshing state... [id=0cbed3f5d1f28eff16734da3fbc29d16]
module.protectedpii_com.cloudflare_record.fastmail-dkim3: Refreshing state... [id=d8ab9d9888d8412f89d8d2f58994c758]
module.realfire_link.cloudflare_record.terraform_managed_resource_04ef8770273f24a074905cf94aa0eb81: Refreshing state... [id=04ef8770273f24a074905cf94aa0eb81]
module.realfire_au.cloudflare_record.terraform_managed_resource_b5500d4b699a1e57af92ba3ed030c37e: Refreshing state... [id=b5500d4b699a1e57af92ba3ed030c37e]
module.protectedpii_com.cloudflare_record.mx2: Refreshing state... [id=652476864062ec2f7084b6d6af6692ab]
module.realfire_au.cloudflare_record.terraform_managed_resource_b007352f3aab9a5cbf1a2360333cd9e8: Refreshing state... [id=b007352f3aab9a5cbf1a2360333cd9e8]
module.realfire_au.cloudflare_record.terraform_managed_resource_ac8ab0f6be08bcffce56effa487da6ca: Refreshing state... [id=ac8ab0f6be08bcffce56effa487da6ca]
module.realfire_dev.cloudflare_record.dmarc: Refreshing state... [id=456bc27d090bc1bccd3ec0247e514feb]
module.protectedpii_com.cloudflare_record.spf: Refreshing state... [id=7ccb3399105f0b8def4f594f8583c52f]
module.realfire_cloud.cloudflare_record.terraform_managed_resource_6910f22baeb25b9122f798ffc168ad21: Refreshing state... [id=6910f22baeb25b9122f798ffc168ad21]
module.realfire_link.cloudflare_record.terraform_managed_resource_2726bfcb3d4468cd0087c2a57d005f6c: Refreshing state... [id=2726bfcb3d4468cd0087c2a57d005f6c]
module.realfire_cloud.cloudflare_record.terraform_managed_resource_b2c5dd3a2faeda844cfceeff25f5c827: Refreshing state... [id=b2c5dd3a2faeda844cfceeff25f5c827]
module.realfire_link.cloudflare_record.terraform_managed_resource_edc1472a0262c4b18110a68391c6a080: Refreshing state... [id=edc1472a0262c4b18110a68391c6a080]
module.realfire_network.cloudflare_record.terraform_managed_resource_d48979982bf0ad0d5be5e2c9e6cb6220: Refreshing state... [id=d48979982bf0ad0d5be5e2c9e6cb6220]
module.realfire_network.cloudflare_record.terraform_managed_resource_fe8df75f03f61295e0eb9dc36661b090: Refreshing state... [id=fe8df75f03f61295e0eb9dc36661b090]
module.protectedpii_com.cloudflare_record.fastmail-dkim1: Refreshing state... [id=512294b89b48a445eb020241cf58da62]
module.realfire_dev.cloudflare_record.mx2: Refreshing state... [id=59094dbe266e0ec82604fe359036edb0]
module.realfire_dev.cloudflare_record.mx3: Refreshing state... [id=4aa00e4f7986c4ecff9a6f5a1a6f12bc]
module.realfire_link.cloudflare_record.terraform_managed_resource_4f093e0e15b521612f05d72708c92968: Refreshing state... [id=4f093e0e15b521612f05d72708c92968]
module.realfire_cloud.cloudflare_record.terraform_managed_resource_5c5abc0fdccae3cbb41c7396281f3aba: Refreshing state... [id=5c5abc0fdccae3cbb41c7396281f3aba]
module.realfire_dev.cloudflare_record.mx1: Refreshing state... [id=e20a1ba9cd2b4da5da3a43db02d6ae93]
module.realfire_au.cloudflare_record.terraform_managed_resource_71ecf873ed39bc95ac289c5fbdd53a80: Refreshing state... [id=71ecf873ed39bc95ac289c5fbdd53a80]
module.protectedpii_com.cloudflare_record.fastmail-dkim2: Refreshing state... [id=0120155210a5a4aefb8c81d4459d4e7a]
module.protectedpii_com.cloudflare_record.dmarc: Refreshing state... [id=dddea226ef92db2c65f2ea2c8e01d0f5]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.realfire_dev.cloudflare_record.fastmail-dkim1 will be created
  + resource "cloudflare_record" "fastmail-dkim1" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "fm1._domainkey"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "CNAME"
      + value           = "fm1.realfire.dev.dkim.fmhosted.com"
      + zone_id         = "3b6f54c1b3b5db42cc518819a7b65bed"
    }

  # module.realfire_dev.cloudflare_record.fastmail-dkim2 will be created
  + resource "cloudflare_record" "fastmail-dkim2" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "fm2._domainkey"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "CNAME"
      + value           = "fm2.realfire.dev.dkim.fmhosted.com"
      + zone_id         = "3b6f54c1b3b5db42cc518819a7b65bed"
    }

  # module.realfire_dev.cloudflare_record.fastmail-dkim3 will be created
  + resource "cloudflare_record" "fastmail-dkim3" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "fm3._domainkey"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "CNAME"
      + value           = "fm3.realfire.dev.dkim.fmhosted.com"
      + zone_id         = "3b6f54c1b3b5db42cc518819a7b65bed"
    }

  # module.realfire_dev.cloudflare_record.mx1 will be updated in-place
  ~ resource "cloudflare_record" "mx1" {
      + allow_overwrite = false
        id              = "e20a1ba9cd2b4da5da3a43db02d6ae93"
        name            = "realfire.dev"
      ~ priority        = 47 -> 10
        tags            = []
      ~ value           = "route1.mx.cloudflare.net" -> "in1-smtp.messagingengine.com"
        # (9 unchanged attributes hidden)
    }

  # module.realfire_dev.cloudflare_record.mx2 will be updated in-place
  ~ resource "cloudflare_record" "mx2" {
      + allow_overwrite = false
        id              = "59094dbe266e0ec82604fe359036edb0"
        name            = "realfire.dev"
      ~ priority        = 95 -> 20
        tags            = []
      ~ value           = "route2.mx.cloudflare.net" -> "in2-smtp.messagingengine.com"
        # (9 unchanged attributes hidden)
    }

  # module.realfire_dev.cloudflare_record.mx3 must be replaced
-/+ resource "cloudflare_record" "mx3" {
      + allow_overwrite = false
      ~ created_on      = "2023-02-11T10:56:26.886064Z" -> (known after apply)
      ~ hostname        = "realfire.dev" -> (known after apply)
      ~ id              = "4aa00e4f7986c4ecff9a6f5a1a6f12bc" -> (known after apply)
      ~ metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
          - "source"                 = "primary"
        } -> (known after apply)
      ~ modified_on     = "2023-10-04T09:18:53.825217Z" -> (known after apply)
      ~ name            = "realfire.dev" -> "*.realfire.dev" # forces replacement
      ~ priority        = 98 -> 10
      ~ proxiable       = false -> (known after apply)
      - tags            = [] -> null
      ~ value           = "route3.mx.cloudflare.net" -> "in1-smtp.messagingengine.com"
        # (4 unchanged attributes hidden)
    }

  # module.realfire_dev.cloudflare_record.mx4 will be created
  + resource "cloudflare_record" "mx4" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "*.realfire.dev"
      + priority        = 20
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "MX"
      + value           = "in2-smtp.messagingengine.com"
      + zone_id         = "3b6f54c1b3b5db42cc518819a7b65bed"
    }

  # module.realfire_dev.cloudflare_record.spf will be updated in-place
  ~ resource "cloudflare_record" "spf" {
      + allow_overwrite = false
        id              = "a04900f1cff0cc9df186393625e9d629"
        name            = "realfire.dev"
        tags            = []
      ~ value           = "v=spf1 include:_spf.mx.cloudflare.net ~all" -> "v=spf1 include:spf.messagingengine.com ?all"
        # (9 unchanged attributes hidden)
    }

Plan: 5 to add, 3 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @RealFireAU, Action: `pull_request`, Workflow: `Terraform Plan`*